---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FrozenBecauseFaceGone
source: html/845dbdcb-7fd5-37c3-e8be-44d71fc8b7f8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FrozenBecauseFaceGone Property

This family instance was hosted by a curved face that is no longer present in the linked file. To move the family instance, rehost it.

## Syntax (C#)
```csharp
public static FailureDefinitionId FrozenBecauseFaceGone { get; }
```